source/blogging-on-ghpages-with-orgmode.org
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+TITLE: blogging on github pages with orgmode
#+AUTHOR: josiah
#+CATEGORY: orgmode

* what i did
i've just moved from using markdown and jekyll to generate a static website on github pages to using org-mode and org-publish to generate static html files, also on github pages.

* why did i do this
my setup has been a pain - i do most of my writing and thinking in [[https://orgmode.org/][org mode]], but to post stuff on https://me.jowj.net/ i have to convert that to markdown (relatively easy, due to a package called [[https://github.com/emacsmirror/org/blob/master/lisp/ox-md.el][ox-md]]) and use [[https://jekyllrb.com/][jekyll]] to convert md to html and handle the generation of the site. the problem with jekyll is that it /sucks/. its a tool based on the ruby ecosystem, and since I actually publish my stuff so infrequently every time i use it i have to update something about my ruby environment. this adds probably 10-20 minutes while I remember / look up which commands i'm supposed to run and why, and figuring out what things are actually broken this time.


  theming in jekyll i also don't really enjoy. i think its a fine way to get started with an easy, responsive look to a blog, but if you wanna have more particular say about it you probably will end up writing your own css. 


  i wanted a way to handle multiple rss feeds; i wanted to be able to blog about personal bullshit AND project/technical work in the same site. obviously, most people are not going to give a shit about both of those things at the same time, so separating the rss feeds out seemed like a pretty straightforward way of handling that! ultimately this was harder than i wanted it to be, but it does seem to work!


  i also just thought it would be cool to do everything within emacs (because my brain is broken lol). now the site is built with emacs and org mode entirely! 

* how it works
most of the configuration and automation is in two files: [[https://github.com/jowj/jowj.github.io/blob/master/publish.el][publish.el]] and [[https://github.com/jowj/jowj.github.io/blob/master/Makefile][Makefile]] (raw links, also pasted below). publish.el has by far the most stuff in it, Makefile is just stupid simple automation.
