posts/blogging-on-ghpages-with-orgmode.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-04-12 Sun 08:36 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>blogging on github:pages with orgmode</title>
<meta name="generator" content="Org mode">
<meta name="author" content="josiah">
<link rel="stylesheet" type="text/css" href="css/my-dark.css"/>
</head>
<body>
<div id="preamble" class="status">
<a href="../index.html">home</a>
<a href="../posts/articles.html">essays</a>
<a href="../personal/articles.html">diary</a>
<a href="https://git.awful.club/projects">projects</a>
<a href="../resume.pdf">resume</a>
</div>
<div id="content">
<header>
<h1 class="title">blogging on github:pages with orgmode</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga9ed6e7">what i did</a></li>
<li><a href="#org82eb3b6">why did i do this</a></li>
<li><a href="#orgb623e80">how it works</a>
<ul>
<li><a href="#orgbb8eb02">publish.el</a></li>
<li><a href="#org18e4b1a">Makefile</a></li>
</ul>
</li>
<li><a href="#org7775c3d">credits &amp; references</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orga9ed6e7" class="outline-2">
<h2 id="orga9ed6e7">what i did</h2>
<div class="outline-text-2" id="text-orga9ed6e7">
<p>
i've just moved from using markdown and jekyll to generate a static website on github pages to using org-mode and org-publish to generate static html files, also on github pages.
</p>
</div>
</div>

<div id="outline-container-org82eb3b6" class="outline-2">
<h2 id="org82eb3b6">why did i do this</h2>
<div class="outline-text-2" id="text-org82eb3b6">
<p>
my setup has been a pain - i do most of my writing and thinking in <a href="https://orgmode.org/">org mode</a>, but to post stuff on <a href="https://me.jowj.net/">https://me.jowj.net/</a> i have to convert that to markdown (relatively easy, due to a package called <a href="https://github.com/emacsmirror/org/blob/master/lisp/ox-md.el">ox-md</a>) and use <a href="https://jekyllrb.com/">jekyll</a> to convert md to html and handle the generation of the site. the problem with jekyll is that it <i>sucks</i>. its a tool based on the ruby ecosystem, and since I actually publish my stuff so infrequently every time i use it i have to update something about my ruby environment. this adds probably 10-20 minutes while I remember / look up which commands i'm supposed to run and why, and figuring out what things are actually broken this time.
</p>


<p>
theming in jekyll i also don't really enjoy. i think its a fine way to get started with an easy, responsive look to a blog, but if you wanna have more particular say about it you probably will end up writing your own css. 
</p>


<p>
i wanted a way to handle multiple rss feeds; i wanted to be able to blog about personal bullshit AND project/technical work in the same site. obviously, most people are not going to give a shit about both of those things at the same time, so separating the rss feeds out seemed like a pretty straightforward way of handling that! ultimately this was harder than i wanted it to be, but it does seem to work!
</p>


<p>
i also just thought it would be cool to do everything within emacs (because my brain is broken lol). now the site is built with emacs and org mode entirely! 
</p>
</div>
</div>

<div id="outline-container-orgb623e80" class="outline-2">
<h2 id="orgb623e80">how it works</h2>
<div class="outline-text-2" id="text-orgb623e80">
<p>
most of the configuration and automation is in two files: <a href="https://github.com/jowj/jowj.github.io/blob/master/publish.el">publish.el</a> and <a href="https://github.com/jowj/jowj.github.io/blob/master/Makefile">Makefile</a> (raw links, also pasted below). publish.el has by far the most stuff in it, Makefile is just stupid simple automation.
</p>
</div>
