posts/blogging-on-ghpages-with-orgmode.html
<div id="outline-container-orgbb8eb02" class="outline-3">
<h3 id="orgbb8eb02">publish.el</h3>
<div class="outline-text-3" id="text-orgbb8eb02">
<p>
i cribbed from several places to build this. in particular, two folks had done something similar and i referred to their work heavily. see the <a href="#org7775c3d">credits &amp; references</a> entry.
</p>

<p>
one of the ways I differed from some of the other configurations I referenced was that i wanted the publishing process to be distinct from my personal <a href="https://git.awful.club/jowj/chd/src/branch/master/.emacs.d">emacs configuration</a>. publishing from within emacs itself is pretty cool, but it'll be cooler when i can publish by just uploading .org files and having github actions run a container and my publishing function on <code>git push</code>. i'm not there yet but <a href="https://gjhenrique.com/meta.html">some people are doing this already with gitlab</a>.
</p>

<p>
since i won't be using my personal emacs config, i'll have to setup package management here as well:
</p>
<div class="org-src-container">
<pre class="src src-elisp" id="orge20c7ab"><span style="color: #5e6263;">;;;; </span><span style="color: #5e6263;">package setup</span>
(<span style="color: #598249;">require</span> '<span style="color: #15968D;">ox-publish</span>)
(package-initialize)

(<span style="color: #598249;">require</span> '<span style="color: #15968D;">package</span>)
(<span style="color: #598249;">setq</span> package-archives
      '((<span style="color: #15968D;">"melpa"</span> . <span style="color: #15968D;">"http://melpa.milkbox.net/packages/"</span>)
        (<span style="color: #15968D;">"gnu"</span> . <span style="color: #15968D;">"http://elpa.gnu.org/packages/"</span>)
        (<span style="color: #15968D;">"elpy"</span> . <span style="color: #15968D;">"http://jorgenschaefer.github.io/packages/"</span>)))

(<span style="color: #598249;">unless</span> (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(<span style="color: #598249;">eval-when-compile</span>
  (<span style="color: #598249;">require</span> '<span style="color: #15968D;">use-package</span>))

(<span style="color: #598249;">use-package</span> <span style="color: #15968D;">htmlize</span>
  <span style="color: #598249;">:ensure</span> t)

(<span style="color: #598249;">use-package</span> <span style="color: #15968D;">webfeeder</span>
  <span style="color: #598249;">:ensure</span> t)
</pre>
</div>

<p>
man i got SO stuck on how to do syntax highlighting AND use my own custom css. if you use the stock html and css templates that ship with org mode (i.e. don't customize anything at all) you can easily add syntax highlighting using the <code>htmlize</code> package. if you override the stock templates then you don't get syntax highlighting by default!! 
</p>

<p>
the actual solution ended up being so simple i'm mad its not in any of the documentation I found expressly, so I'm going to make sure i write a googlable phrase about it:
</p>

<ul class="org-ul">
<li>"fix syntax highlighting when using custom css in emacs org mode by defining font-locks manually."</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp" id="orgbaefd56"><span style="color: #5e6263;">;; </span><span style="color: #5e6263;">fucking custom colors eluded me until this shit.</span>
<span style="color: #5e6263;">;; </span><span style="color: #5e6263;">reference this guy's setup, he's a king:</span>
<span style="color: #5e6263;">;; </span><span style="color: #5e6263;">https://gitlab.com/jgkamat/jgkamat.gitlab.io/-/blob/master/jgkamat-website.el</span>
(<span style="color: #598249;">when</span> noninteractive
  <span style="color: #5e6263;">;; </span><span style="color: #5e6263;">Don't run in interactive mode to avoid breaking your colors</span>
  (custom-set-faces
   '(default                      ((t (<span style="color: #598249;">:foreground</span> <span style="color: #15968D;">"#909396"</span> <span style="color: #598249;">:background</span> <span style="color: #15968D;">"#262626"</span>))))
   '(font-lock-builtin-face       ((t (<span style="color: #598249;">:foreground</span> <span style="color: #15968D;">"#598249"</span>))))
   '(font-lock-comment-face       ((t (<span style="color: #598249;">:foreground</span> <span style="color: #15968D;">"#5e6263"</span>))))
   '(font-lock-constant-face      ((t (<span style="color: #598249;">:foreground</span> <span style="color: #15968D;">"#15968D"</span>))))
   '(font-lock-function-name-face ((t (<span style="color: #598249;">:foreground</span> <span style="color: #15968D;">"#2F7BDE"</span>))))
   '(font-lock-keyword-face       ((t (<span style="color: #598249;">:foreground</span> <span style="color: #15968D;">"#598249"</span>))))
   '(font-lock-string-face        ((t (<span style="color: #598249;">:foreground</span> <span style="color: #15968D;">"#15968D"</span>))))
   '(font-lock-type-face                       ((t (<span style="color: #598249;">:foreground</span> <span style="color: #15968D;">"#598249"</span>))))
   '(font-lock-variable-name-face ((t (<span style="color: #598249;">:foreground</span> <span style="color: #15968D;">"#2F7BDE"</span>))))
   '(font-lock-warning-face       ((t (<span style="color: #598249;">:foreground</span> <span style="color: #15968D;">"#bd3832"</span> <span style="color: #598249;">:weight</span> bold)))))
  (<span style="color: #598249;">setq</span> htmlize-use-rgb-map 'force))
</pre>
</div>

<p>
ok so that's all the like 'setup' type shit out of the way. after that i ran into several frustrating org mode limitations or&#x2026;decisions made by org mode that make blogging with it a bit of a pain. A ton of the config is dedicated to working around those problems.
</p>

<ul class="org-ul">
<li>why the fuck is an 'html validation link' part of the default postamble config? who is this useful for?</li>
<li>why does the largest orgmode package built for static site generation for org mode think you want to build off of a single org mode file with blog posts as headings?
<ul class="org-ul">
<li>that is stupid. org-mode itself doesn't care about your file hierarchy and neither should you :|</li>
</ul></li>
<li>why is defining a custom stylesheet such a pain in the dick lmao.
<ul class="org-ul">
<li>there's a like a million ways to do this, ranging from updating default variables to adding it in every single .org file, but they all have frustrating limitations!</li>
</ul></li>
<li>having nav buttons at the top or side of the screen for different categories is pretty basic but unsupported by default. you have to write your own weird hack for this; i chose to add it to the preamble on every page using dynamic file name expansion, but i saw several different solutions to this problem:
<ul class="org-ul">
<li>some people did it in the preamble like me</li>
<li>some people did it in the postamble</li>
<li>some people created a file called like "nav.org" and used org-mode <code>includes</code> on every page to reference it. I thought this was the ugliest option in general, but its by far the easiest!</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #5e6263;">;;;; </span><span style="color: #5e6263;">custom var/func defs to deal with frustrating org limitations</span>
(<span style="color: #598249;">setq</span> make-backup-files nil)
(<span style="color: #598249;">setq</span> org-html-postamble t
      org-html-validation-link nil)

(<span style="color: #598249;">defvar</span> <span style="color: #2F7BDE;">org-blog-date-format</span> <span style="color: #15968D;">"%h %d, %Y"</span>
  <span style="color: #15968D;">"Format for displaying publish dates."</span>)

(<span style="color: #598249;">defvar</span> <span style="color: #2F7BDE;">jlj/root</span> (expand-file-name <span style="color: #15968D;">"."</span>))
(<span style="color: #598249;">defvar</span> <span style="color: #2F7BDE;">org-blog-head</span> <span style="color: #15968D;">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"css/my-dark.css\"/&gt;"</span>)
(<span style="color: #598249;">defvar</span> <span style="color: #2F7BDE;">org-personal-head</span> <span style="color: #15968D;">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"../posts/css/my-dark.css\"/&gt;"</span>)
(<span style="color: #598249;">defvar</span> <span style="color: #2F7BDE;">org-index-head</span> <span style="color: #15968D;">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"posts/css/my-dark.css\"/&gt;"</span>)

(<span style="color: #598249;">defun</span> <span style="color: #2F7BDE;">jlj/preamble</span> (info)
  <span style="color: #15968D;">"Return preamble as a string.  INFO."</span>
  <span style="color: #15968D;">"This is required to dynamically link shit depending on where you on in the folder structure."</span>
  (<span style="color: #598249;">let*</span> ((file (plist-get info <span style="color: #598249;">:input-file</span>))
         (prefix (file-relative-name (expand-file-name jlj/root)
                                     (file-name-directory file))))
    (format
     <span style="color: #15968D;">"&lt;a href=\"%1$s/index.html\"&gt;home&lt;/a&gt;</span>
<span style="color: #15968D;">&lt;a href=\"%1$s/posts/articles.html\"&gt;essays&lt;/a&gt;</span>
<span style="color: #15968D;">&lt;a href=\"%1$s/personal/articles.html\"&gt;diary&lt;/a&gt;</span>
<span style="color: #15968D;">&lt;a href=\"https://git.awful.club/projects\"&gt;projects&lt;/a&gt;</span>
<span style="color: #15968D;">&lt;a href=\"%1$s/resume.pdf\"&gt;resume&lt;/a&gt;"</span>
     prefix)))

(<span style="color: #598249;">setq</span> org-html-postamble-format `((<span style="color: #15968D;">"en"</span> ,(concat <span style="color: #15968D;">"&lt;p class=\"creator\"&gt;Made with %c&lt;/p&gt;&lt;/p&gt;"</span>))))
(<span style="color: #598249;">setq</span> org-html-preamble #'jlj/preamble)
</pre>
</div>

<p>
<code>org-publish-project-alist</code> is the meat of the static site generation. you define a list of components of your site and have different variable settings for each component. i have several different components created:
</p>

<ul class="org-ul">
<li><code>site-org</code> publishes all my technical writing.</li>
<li><code>site-index</code> publishes just my home page.</li>
<li><code>site-personal</code> publishes my diary entries.</li>
<li><code>site-static</code> is currently not doing what I want it to! its <i>supposed</i> copy ANY file that is not a .org file and publish it, but it doesn't seem to be doing that. I'm <span class="underline">very</span> certain its just because I don't understand its arguments well, so, like, don't copy my config about that. its still being worked on!</li>
</ul>

<p>
<code>jlj/publish-sitemap</code> is a function that wraps <code>org-publish-sitemap</code> and adds in my own css file. as far as I can tell, there is NO OTHER WAY to get the sitemap file generated by the <code>org-publish-project-alist</code> declarations to use custom css. infuriating.  because this is emacs and org mode there are of course other work-arounds possible here, but!! this should not require a work around, this is basic!!
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org9bfe90e">(<span style="color: #598249;">setq</span> org-publish-project-alist
      (list
       (list <span style="color: #15968D;">"site-org"</span>
             <span style="color: #598249;">:base-directory</span> <span style="color: #15968D;">"./source"</span>
             <span style="color: #598249;">:recursive</span> t
             <span style="color: #598249;">:exclude</span> <span style="color: #15968D;">"index.org"</span>
             <span style="color: #598249;">:publishing-function</span> '(org-html-publish-to-html)
             <span style="color: #598249;">:publishing-directory</span> <span style="color: #15968D;">"./posts/"</span>
             <span style="color: #598249;">:sitemap-title</span> <span style="color: #15968D;">"a list of stuff i wrote"</span>
             <span style="color: #598249;">:sitemap-filename</span> <span style="color: #15968D;">"articles.org"</span>
             <span style="color: #598249;">:auto-sitemap</span> t
             <span style="color: #598249;">:sitemap-style</span> 'list
             <span style="color: #598249;">:sitemap-sort-files</span> 'anti-chronologically
             <span style="color: #598249;">:html-html5-fancy</span> t
             <span style="color: #598249;">:html-doctype</span> <span style="color: #15968D;">"html5"</span>
             <span style="color: #598249;">:html-head-include-default-style</span> nil
             <span style="color: #598249;">:html-head</span> org-blog-head)
       (list <span style="color: #15968D;">"site-index"</span>
             <span style="color: #598249;">:base-directory</span> <span style="color: #15968D;">"."</span>
             <span style="color: #598249;">:recursive</span> nil
             <span style="color: #598249;">:publishing-function</span> '(org-html-publish-to-html)
             <span style="color: #598249;">:publishing-directory</span> <span style="color: #15968D;">"."</span>
             <span style="color: #598249;">:html-head</span> org-index-head)
       (list <span style="color: #15968D;">"site-personal"</span>
             <span style="color: #598249;">:base-directory</span> <span style="color: #15968D;">"./personal-source"</span>
             <span style="color: #598249;">:recursive</span> t
             <span style="color: #598249;">:exclude</span> <span style="color: #15968D;">"index.org"</span>
             <span style="color: #598249;">:publishing-function</span> '(org-html-publish-to-html)
             <span style="color: #598249;">:publishing-directory</span> <span style="color: #15968D;">"./personal/"</span>
             <span style="color: #598249;">:sitemap-title</span> <span style="color: #15968D;">"personal bullshit"</span>
             <span style="color: #598249;">:sitemap-filename</span> <span style="color: #15968D;">"articles.org"</span>
             <span style="color: #598249;">:auto-sitemap</span> t
             <span style="color: #598249;">:sitemap-style</span> 'list
             <span style="color: #598249;">:sitemap-sort-files</span> 'anti-chronologically
             <span style="color: #598249;">:html-head-include-default-style</span> nil
             <span style="color: #598249;">:html-head</span> org-personal-head)
       (list <span style="color: #15968D;">"site-static"</span>
             <span style="color: #598249;">:base-directory</span> <span style="color: #15968D;">"."</span>
             <span style="color: #598249;">:base-extension</span> 'any
             <span style="color: #598249;">:exclude</span> <span style="color: #15968D;">"\\.org\\'"</span>
             <span style="color: #598249;">:publishing-directory</span> <span style="color: #15968D;">"."</span>
             <span style="color: #598249;">:publishing-function</span> 'org-publish-attachment
             <span style="color: #598249;">:recursive</span> t)
       (list <span style="color: #15968D;">"site"</span> <span style="color: #598249;">:components</span> '(<span style="color: #15968D;">"site-org"</span>))))



(<span style="color: #598249;">defun</span> <span style="color: #2F7BDE;">jlj/publish-sitemap</span> (title list)
  <span style="color: #15968D;">"Replace org-publish-sitemap.  TITLE and LIST are magic fuck u linter i won't do wat u tell me."</span>

  (org-publish-sitemap
   (concat <span style="color: #15968D;">"#+TITLE: "</span> title <span style="color: #15968D;">"\n"</span>
          <span style="color: #15968D;">"#+HTML_HEAD: &lt;link rel=\"stylesheet\" type=\"text/css\" href=\"css/my-dark.css\"&gt;"</span>
          <span style="color: #15968D;">"\n"</span>
          (org-list-to-org list)))
)
</pre>
</div>


<p>
finally, i actually publish the site and then generate some rss feeds. i want so specifically talk about the rss feed generation; the most well known package for rss feed gen is <a href="https://github.com/yyr/org-mode/blob/master/contrib/lisp/ox-rss.el">ox-rss</a> and i could not get that package to work. i used <a href="https://gitlab.com/ambrevar/emacs-webfeeder/-/tree/master">webfeeder.el</a> and had much better luck with it.
</p>

<p>
its important to note that i wrap org-publish-all and the webfeeder lines with my own function <code>jlj/publish</code>. the org project <span class="underline">must</span> be published prior to the webfeeder feed generation. <code>webfeeder.el</code> works by generating a feed based on your .html files, not your .org files. 
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #598249;">defun</span> <span style="color: #2F7BDE;">jlj/publish</span> ()
    <span style="color: #15968D;">"Wrap org-publish-all so that its easier to modify this in the future."</span>
    (org-publish-all)

    <span style="color: #5e6263;">;; </span><span style="color: #5e6263;">build rss for interesting posts</span>
    (<span style="color: #598249;">setq</span> webfeeder-default-author <span style="color: #15968D;">"josiah <a href="mailto:me%40jowj.net">&lt;me@jowj.net&gt;</a>"</span>)
    (webfeeder-build
     <span style="color: #15968D;">"rss.xml"</span>
     <span style="color: #15968D;">"./posts"</span>
     <span style="color: #15968D;">"https://me.jowj.net/posts/"</span>

     (delete <span style="color: #15968D;">"index.html"</span>
             (mapcar (<span style="color: #598249;">lambda</span> (f) (replace-regexp-in-string <span style="color: #15968D;">".*/posts/"</span> <span style="color: #15968D;">""</span> f))
                     (file-expand-wildcards <span style="color: #15968D;">"~/Documents/projects/jlj-blog/posts/*.html"</span>)))
     <span style="color: #598249;">:builder</span> 'webfeeder-make-rss
     <span style="color: #598249;">:title</span> <span style="color: #15968D;">"josiahs blog"</span>
     <span style="color: #598249;">:description</span> <span style="color: #15968D;">"projects/writing bullshit in rss."</span>)

    <span style="color: #5e6263;">;; </span><span style="color: #5e6263;">build rss for diary posts</span>
    (webfeeder-build
     <span style="color: #15968D;">"rss.xml"</span>
     <span style="color: #15968D;">"./personal"</span>
     <span style="color: #15968D;">"https://me.jowj.net/personal/"</span>

     (delete <span style="color: #15968D;">"index.html"</span>
             (mapcar (<span style="color: #598249;">lambda</span> (f) (replace-regexp-in-string <span style="color: #15968D;">".*/personal/"</span> <span style="color: #15968D;">""</span> f))
                     (file-expand-wildcards <span style="color: #15968D;">"~/Documents/projects/jlj-blog/personal/*.html"</span>)))
     <span style="color: #598249;">:builder</span> 'webfeeder-make-rss
     <span style="color: #598249;">:title</span> <span style="color: #15968D;">"josiahs diary"</span>
     <span style="color: #598249;">:description</span> <span style="color: #15968D;">"personal bullshit in rss."</span>)
  )
</pre>
</div>
</div>
</div>
