source/blogging-on-ghpages-with-orgmode.org
** Makefile
super easy makefile lol. 
- run emacs with no init file
- tell it to load publish.el
- tell it run my publishing function

on clean, tell it to remove a bunch of files and folders that gave me grief. many of these won't be generated anymore, i fixed the problem that necessitated me adding the corresponding line! but i leave it in anyway.

if you're unfamiliar with make you can still use this without learning /any/ make primitives, you can just, in the directory with the Makefile, run these commands:
- ~make~ will build the site from scratch
- ~make clean~ will delete all the generated files.
#+BEGIN_SRC makefile
# Makefile for jlj blog
.PHONY: all publish publish_no_init

all: publish

publish: publish.el
	@echo "Publishing...."
	emacs --no-init --script publish.el --funcall=jlj/publish

clean:
	@echo "Cleaning up.."
	@rm -rvf *.elc
	@rm -rvf posts/*.html
	@rm -fv index.html
	@rm -fv index.xml
	@rm -fv posts/articles.xml
	@rm -fv posts/rss.xml
	@rm -fv posts/atom.xml
	@rm -fv personal/*.html
	@rm -fv personal/rss.xml
	@rm -fv personal/atom.xml
	@rm -fv source/*.html
	@rm -rvf ~/.org-timestamps/*

#+END_SRC
* credits & references
there are a TON of places to read about doing this sort of thing. two folks in particular were really useful to me:
- [[https://ambrevar.xyz/index.html][Ambrevar]],  (in particular, https://ambrevar.xyz/blog-architecture/index.html)
- [[https://jgkamat.gitlab.io/][jgkamat]],  (in particular, https://jgkamat.gitlab.io/blog/website1.html)

jgkamat's publish files lead me to the font-face-locking approach to custom syntax highlighting.
ambrevar actually wrote the webfeeder.el solution to the idiot org rss problem. both of these folks are fantastic.

- https://orgmode.org/worg/ has several useful entries on org > html publishing
- https://www.brautaset.org/articles/2017/blogging-with-org-mode.html 
- https://opensource.com/article/20/3/blog-emacs
- https://www.sadiqpk.org/blog/2018/08/08/blogging-with-org-mode.html
- a lot more i've forgotten.
