posts/blogging-on-ghpages-with-orgmode.html
<div id="outline-container-org18e4b1a" class="outline-3">
<h3 id="org18e4b1a">Makefile</h3>
<div class="outline-text-3" id="text-org18e4b1a">
<p>
super easy makefile lol. 
</p>
<ul class="org-ul">
<li>run emacs with no init file</li>
<li>tell it to load publish.el</li>
<li>tell it run my publishing function</li>
</ul>

<p>
on clean, tell it to remove a bunch of files and folders that gave me grief. many of these won't be generated anymore, i fixed the problem that necessitated me adding the corresponding line! but i leave it in anyway.
</p>

<p>
if you're unfamiliar with make you can still use this without learning <i>any</i> make primitives, you can just, in the directory with the Makefile, run these commands:
</p>
<ul class="org-ul">
<li><code>make</code> will build the site from scratch</li>
<li><code>make clean</code> will delete all the generated files.</li>
</ul>
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #5e6263;"># </span><span style="color: #5e6263;">Makefile for jlj blog</span>
<span style="color: #2F7BDE;">.PHONY</span>: all publish publish_no_init

<span style="color: #2F7BDE;">all</span>: publish

<span style="color: #2F7BDE;">publish</span>: publish.el
        <span style="color: #598249;">@</span>echo <span style="color: #15968D;">"Publishing...."</span>
        emacs --no-init --script publish.el --funcall=jlj/publish

<span style="color: #2F7BDE;">clean</span>:
        <span style="color: #598249;">@</span>echo <span style="color: #15968D;">"Cleaning up.."</span>
        <span style="color: #598249;">@</span>rm -rvf *.elc
        <span style="color: #598249;">@</span>rm -rvf posts/*.html
        <span style="color: #598249;">@</span>rm -fv index.html
        <span style="color: #598249;">@</span>rm -fv index.xml
        <span style="color: #598249;">@</span>rm -fv posts/articles.xml
        <span style="color: #598249;">@</span>rm -fv posts/rss.xml
        <span style="color: #598249;">@</span>rm -fv posts/atom.xml
        <span style="color: #598249;">@</span>rm -fv personal/*.html
        <span style="color: #598249;">@</span>rm -fv personal/rss.xml
        <span style="color: #598249;">@</span>rm -fv personal/atom.xml
        <span style="color: #598249;">@</span>rm -fv source/*.html
        <span style="color: #598249;">@</span>rm -rvf ~/.org-timestamps/*

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7775c3d" class="outline-2">
<h2 id="org7775c3d">credits &amp; references</h2>
<div class="outline-text-2" id="text-org7775c3d">
<p>
there are a TON of places to read about doing this sort of thing. two folks in particular were really useful to me:
</p>
<ul class="org-ul">
<li><a href="https://ambrevar.xyz/index.html">Ambrevar</a>,  (in particular, <a href="https://ambrevar.xyz/blog-architecture/index.html">https://ambrevar.xyz/blog-architecture/index.html</a>)</li>
<li><a href="https://jgkamat.gitlab.io/">jgkamat</a>,  (in particular, <a href="https://jgkamat.gitlab.io/blog/website1.html">https://jgkamat.gitlab.io/blog/website1.html</a>)</li>
</ul>

<p>
jgkamat's publish files lead me to the font-face-locking approach to custom syntax highlighting.
ambrevar actually wrote the webfeeder.el solution to the idiot org rss problem. both of these folks are fantastic.
</p>

<ul class="org-ul">
<li><a href="https://orgmode.org/worg/">https://orgmode.org/worg/</a> has several useful entries on org &gt; html publishing</li>
<li><a href="https://www.brautaset.org/articles/2017/blogging-with-org-mode.html">https://www.brautaset.org/articles/2017/blogging-with-org-mode.html</a></li>
<li><a href="https://opensource.com/article/20/3/blog-emacs">https://opensource.com/article/20/3/blog-emacs</a></li>
<li><a href="https://www.sadiqpk.org/blog/2018/08/08/blogging-with-org-mode.html">https://www.sadiqpk.org/blog/2018/08/08/blogging-with-org-mode.html</a></li>
<li>a lot more i've forgotten.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator">Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p></p>
</div>
</body>
</html>
